{
  "What courses are offered at VNIW?": "VNIW offers B.Tech in CSE, CSE‑AI & ML, IT, ECE, and EEE, along with M.Tech (CSE/ECE) and MBA (Finance, HR, Marketing).",
  "How many seats are available for CSE?": "CSE B.Tech has 120 seats at VNIW.",
  "Is VNIW AICTE-approved and JNTUK-affiliated?": "Yes, VNIW is AICTE-approved and affiliated with JNTU Kakinada.",
  "Who is the Principal of VNIW?": "Dr. P. Radhika currently serves as the Principal.",
  "Who is the Chairman of Vignan Group?": "Dr. Lavu Rathaiah is the Founder & Chairman.",
  "What is the annual tuition fee for B.Tech?": "Approximately ₹49,200 per year.",
  "What are the hostel facilities and fees?": "Hostel provides secure accommodation, vegetarian food, Wi‑Fi, 24×7 security; fees approx ₹80,000/year.",
  "Does VNIW have transport facilities?": "Yes, college buses run on major routes in Guntur and nearby towns.",
  "Tell me about the library facilities?": "The library holds 10,000+ books, e-journals, and offers NPTEL video access.",
  "Tell me about the placement cell at VNIW?": "VNIW has a dedicated Placement Cell that conducts training and invites top companies for campus drives.",
  "What extracurricular activities are offered?": "Clubs and activities include NSS, IEEE, CSI, cultural and entrepreneurship clubs.",
  "Who is the HOD of CSE department?": "Dr. P. Lakshman Narayana is the HOD of CSE.",
  "Who is the HOD of IT department?": "Dr. K. V. S. S. Rama Krishna is the HOD of IT.",
  "Who is the HOD of ECE department?": "Dr. Sandhya is the HOD of ECE.",
  "Who is the HOD of EEE department?": "Dr. Sirisha is the HOD of EEE.",
  "Who is the HOD of AI and DS department?": "Dr. Shilpa Chaitanya is the HOD of AI and DS.",
  "Who is the HOD of MBA department?": "Dr. Venu Madhavi Manikonda is the HOD of MBA.",
  "What is the vision of VNIW?": "To empower women through quality technical education, leadership, and values.",
  "What is the mission of VNIW?": "To promote excellence in technical education through innovation, research, and women-centric development.",
  "Which companies recruit from VNIW?": "Infosys, TCS, Wipro, Cognizant, HCL, Capgemini, and Tech Mahindra are some key recruiters.",
  "What is the placement record of VNIW?": "VNIW consistently achieves 85-90% placements every year in top companies.",
  "What is the average package offered during placements?": "The average package is ₹3–6 LPA, with higher offers in IT and core roles.",
  "What clubs are active on campus?": "NSS, IEEE, CSI, Dance Club, Music Club, Entrepreneurship Cell, and more.",
  "Is there a grievance redressal system?": "Yes, VNIW has a Women’s Empowerment and Grievance Redressal Cell.",
  "What are the anti-ragging policies at VNIW?": "VNIW follows strict anti-ragging policies as per AICTE/UGC guidelines.",
  "Are there any technical events or fests?": "Yes, VNIW organizes annual fests, hackathons, workshops, and tech events.",
  "How can students access NPTEL resources?": "Through the library's digital platform with student login access.",
  "Does the college support sports and games?": "Yes, VNIW has a sports department with indoor/outdoor facilities.",
  "What departments exist at VNIW?": "CSE, IT, ECE, EEE, MBA, CSM, CSD and Basic Sciences & Humanities.",
  "How is the student feedback taken at VNIW?": "Through regular surveys, mentor feedback, and online feedback forms.",
  "Is there a cafeteria on campus?": "Yes, VNIW has a hygienic cafeteria with vegetarian options.",
  "Are there guest lectures conducted?": "Yes, by industry experts and academic professionals regularly.",
  "Is there support for higher education exams like GATE/IELTS?": "Yes, VNIW offers training sessions and coaching resources.",
  "What are the lab facilities like?": "All departments have fully equipped labs for practical learning and research.",
  "Is the campus Wi-Fi enabled?": "Yes, Wi-Fi is available across campus and hostels.",
  "Does the college have an ERP system?": "Yes, students can check attendance, results, and updates via ERP portal.",
  "How many faculty members are in the CSE department?": "The CSE department has 25+ qualified faculty members.",
  "Are internships mandatory for students?": "Yes, students undergo internships as part of their academic curriculum.",
  "Does VNIW provide scholarships?": "Yes, merit-based and government scholarships are available.",
  "What kind of projects do students work on?": "Final year projects include AI, ML, IoT, Web Dev, and core engineering areas.",
  "Are there any language or soft skills classes?": "Yes, the college has a Language Lab and soft skills sessions.",
  "What are the working hours of the college?": "Monday to Saturday: 9 AM to 4 PM.",
  "How can parents contact faculty?": "Through the parent portal or scheduled parent-teacher meetings.",
  "Does the college provide training for campus placements?": "Yes, through CRT (Campus Recruitment Training) programs.",
  "What is the exam pattern at VNIW?": "Follows JNTUK pattern: 2 mid exams and one semester-end exam.",
  "What is the attendance requirement?": "Minimum 75% attendance is mandatory to appear for exams.",
  "How are student grievances handled?": "Via student mentor system, grievance portal, and feedback mechanism.",
  "Are there any industrial visits arranged?": "Yes, departments arrange regular industrial visits to nearby companies.",
  "How are student projects evaluated?": "Through internal reviews, viva-voce, and faculty evaluations.",
  "What are the digital learning tools used?": "Google Classroom, Zoom, LMS portals, and NPTEL resources.",
  "What is the dress code at VNIW?": "Formal attire is expected; uniforms are recommended in some departments.",
  "Are students involved in social responsibility programs?": "Yes, through NSS, blood donation, Swachh Bharat, and awareness campaigns.",
  "What is the process for exam revaluation?": "Students can apply online for JNTUK revaluation within the deadline.",
  "How is security maintained on campus?": "24×7 CCTV surveillance and security staff ensure safety.",
  "Are alumni connected to VNIW?": "Yes, alumni meets are organized, and they contribute to mentoring.",
  "What programming languages are taught in CSE?": "C, Java, Python, and Web Development stacks are taught.",
  "Is AI & ML part of the curriculum?": "Yes, offered under CSE-AI&ML specialization and elective courses.",
  "Are there MOUs with industry?": "Yes, VNIW has MOUs with Infosys, TASK, and others for training.",
  "How is student discipline enforced?": "Through code of conduct, mentor monitoring, and deans.",
  "Are online classes available during emergencies?": "Yes, via Google Meet and Zoom during lockdowns or emergencies.",
  "What is the procedure for new admissions?": "Based on EAMCET counseling, followed by spot admissions if available.",
  "Are first-year students assigned mentors?": "Yes, each student is assigned a faculty mentor.",
  "What labs are there in the ECE department?": "Electronic Devices, Analog Comm, VLSI, and Microprocessor labs.",
  "What is the minimum CGPA for placements?": "Generally, a minimum CGPA of 6.0 is preferred by recruiters.",
  "Are girls from rural areas supported?": "Yes, with hostel, transport, scholarships, and soft skill training.",
  "What is the full form of VNIW?": "Vignan’s Nirula Institute of Technology and Science for Women.",
  "Can students participate in external coding contests?": "Yes, participation in Smart India Hackathon, CodeChef, etc., is encouraged.",
  "Are there bridge courses for new joiners?": "Yes, especially in Maths, English, and Programming Basics.",
  "How is the environment for innovation?": "Students are encouraged to build prototypes, publish papers, and join startup cells.",
  "Does VNIW support entrepreneurship?": "Yes, through an E-Cell and sessions with startup mentors.",
  "What software tools are used in labs?": "MATLAB, Python, Xilinx, Visual Studio, Turbo C, and more.",
  "Are there any cultural festivals?": "Yes, annual day and college fests are conducted with music, dance, and competitions.",
  "Can final-year students showcase their projects?": "Yes, via project expos and online demo sessions.",
  "Are students given project internships?": "Yes, especially during final semesters in collaboration with industry.",
  "Does the college assist with lateral entry admissions?": "Yes, Diploma holders can apply via ECET for lateral entry into 2nd year.",
  "How do I contact the admissions office?": "Call 0863-2343010 or email info@vignannirula.org for admissions-related queries.",
  "What languages are taught in the Language Lab?": "English communication, soft skills, and business communication modules are taught.",
  "Are industrial visits organized?": "Yes, students visit industries like BSNL, DRDO, and local IT firms.",
  "How are internal marks calculated?": "Based on mid exams, assignments, and lab performance.",
  "Is biometric attendance used?": "Yes, biometric systems are in place for accurate attendance.",
  "Can students do mini-projects in 2nd year?": "Yes, guided mini-projects are encouraged from the 2nd year onward.",
  "Is there a grievance redressal portal?": "Yes, online and offline grievance mechanisms are available for students.",
  "What certifications can students take?": "Students can take NPTEL, Oracle, Microsoft, Python, and AWS certifications.",
  "What is the dress code at VNIW?": "Formal dress code is expected; uniforms are mandatory for labs.",
  "Does VNIW celebrate Women’s Day?": "Yes, with seminars, competitions, and motivational sessions.",
  "How is student discipline maintained?": "Strict rules, mentorship, and faculty monitoring ensure discipline.",
  "Are virtual labs available?": "Yes, students are encouraged to use IIT virtual lab platforms.",
  "Are parents updated on student progress?": "Yes, through SMS, ERP, and parent meetings every semester.",
  "Does the college offer MOOC platforms?": "Yes, students use NPTEL, Coursera, and SWAYAM platforms.",
  "Is there a research and development cell?": "Yes, R&D Cell promotes innovation, paper publications, and funding.",
  "How is EEE department lab infrastructure?": "Labs like Electrical Machines, Power Systems, and Control Systems are well-equipped.",
  "Can students apply for patent support?": "Yes, students can apply via IIC (Institution Innovation Council) at VNIW.",
  "What kind of sports tournaments are held?": "Inter-college tournaments in cricket, volleyball, chess, carroms, etc.",
  "Are there summer internships for MBA?": "Yes, MBA students must complete internships in 2nd semester.",
  "Is the college NAAC accredited?": "Yes, VNIW has received NAAC accreditation for quality standards.",
  "What is the intake for MBA?": "MBA has an annual intake of 60 students.",
  "How many labs are in the IT department?": "The IT department has 5+ modern labs including DAA, DBMS, and Web Tech labs.",
  "Are there any women's safety initiatives?": "Yes, CCTV surveillance, grievance helplines, and awareness sessions are in place.",
  "Hi": "Hello! How can I assist you today about VNIW?",
  "Hello": "Hi there! Ask me anything about VNIW's academics, admissions, or campus life.",
  "How are you?": "I'm great and ready to help you with any VNIW-related queries!",
  "What can you do?": "I can answer your questions about VNIW, analyze student performance, and suggest improvements.",
  "Who created you?": "I was built for Vignan’s Nirula Institute of Technology and Science for Women to assist students.",
  "Can you help me?": "Absolutely! Please type your question about VNIW or your academics.",
  "Tell me something about VNIW": "VNIW is a premier women’s engineering college in Palakaluru, Guntur, known for excellence in technical education.",
  "Can you give me suggestions to improve academics?": "Yes! Upload or type your performance and I’ll give friendly improvement tips.",
  "Are you friendly?": "Yes! I'm designed to be helpful, polite, and supportive like a mentor.",
  "What is the dress code at VNIW?": "Formal dress code is expected; uniforms are mandatory for labs.",
  "Are there any guest lectures?": "Yes, guest lectures are conducted by industry professionals and academic experts.",
  "What is the process for admission?": "Admission is through EAMCET counseling, followed by spot admissions if available.",
  "Are there any guest lectures?": "Yes, guest lectures are conducted by industry professionals and academic experts.",
  "What is the process for admission?": "Admission is through EAMCET counseling, followed by spot admissions if available.",
  "Are there any guest lectures?": "Yes, guest lectures are conducted by industry professionals and academic experts.",
  "What courses are offered at VNIW?": "VNIW offers B.Tech in CSE, CSE‑AI & ML, IT, ECE, and EEE, along with M.Tech (CSE/ECE) and MBA (Finance, HR, Marketing).",
  "How many seats are available for CSE?": "CSE B.Tech has 120 seats at VNIW.",
  "Is VNIW AICTE-approved and JNTUK-affiliated?": "Yes, VNIW is AICTE-approved and affiliated with JNTU Kakinada.",
  "Who is the Principal of VNIW?": "Dr. P. Radhika currently serves as the Principal.",
  "Who is the Chairman of Vignan Group?": "Dr. Lavu Rathaiah is the Founder & Chairman.",
  "What is the annual tuition fee for B.Tech?": "Approximately ₹49,200 per year.",
  "What are the hostel facilities and fees?": "Hostel provides secure accommodation, vegetarian food, Wi‑Fi, 24×7 security; fees approx ₹80,000/year.",
  "Does VNIW have transport facilities?": "Yes, college buses run on major routes in Guntur and nearby towns.",
  "Tell me about the library facilities?": "The library holds 10,000+ books, e-journals, and offers NPTEL video access.",
  "Tell me about the placement cell at VNIW?": "VNIW has a dedicated Placement Cell that conducts training and invites top companies for campus drives.",
  "What extracurricular activities are offered?": "Clubs and activities include NSS, IEEE, CSI, cultural and entrepreneurship clubs.",
  "Does VNIW support GATE coaching?": "Yes, GATE coaching sessions are available for interested students.",
  "Is there a Women Empowerment Cell?": "Yes, VNIW has an active Women Empowerment Cell.",
  "Can I apply online for admission?": "Yes, you can apply online through the VNIW official website.",
  "What is the location of VNIW?": "VNIW is located in Palakaluru, Guntur, Andhra Pradesh.",
  "Are lateral entry admissions allowed?": "Yes, diploma holders can join B.Tech through lateral entry.",
  "Is there a parent login portal?": "Yes, VNIW offers a parent portal for academic tracking.",
  "Is there any startup or innovation support?": "Yes, students are encouraged through E-Cell and innovation hubs.",
  "What are the MBA specializations offered?": "Finance, Marketing, and Human Resources.",
  "Does the college provide digital attendance?": "Yes, attendance is tracked and visible on ERP.",
  "Are the classrooms ICT enabled?": "Yes, classrooms are equipped with projectors and smart tools.",
  "How to reach the college from Guntur railway station?": "Take an auto or college bus; it is approx 6 km away.",
  "What are the qualifications of faculty in CSE?": "Most faculty hold M.Tech or PhDs with research publications.",
  "Is there a fee reimbursement scheme?": "Yes, eligible students can apply through government portals.",
  "Are value-added courses available?": "Yes, VNIW offers training on Python, Java, Web Dev, etc.",
  "What achievements has the college earned?": "NBA accreditation, top placements, and student innovations.",
  "Is there an alumni network?": "Yes, alumni connect through events and mentoring sessions.",
  "Does VNIW have an anti-sexual harassment committee?": "Yes, POSH committee is established as per UGC norms.",
  "What are the documents required for admission?": "EAMCET rank card, SSC marks memo, transfer certificate, etc.",
  "Is there on-campus medical aid?": "Yes, first-aid and doctor-on-call facilities are available.",
  "Are seminars conducted regularly?": "Yes, seminars are held for technical, managerial, and soft skills.",
  "What is the college contact number?": "You can reach VNIW at +91‑866‑2976301 / +91‑9010933369.",
  "Can I contact departments directly?": "Yes, each department’s contact info is listed on the website.",
  "What is the college's website URL?": "Visit https://vignannirula.org for all official details.",
  "Are students trained in ethics and leadership?": "Yes, sessions are included in orientation and value education.",
  "Where is the Python lab located?": "The Python lab is on the second floor of the academic block, inside the CSE department.",
  "Where is the Data Structures lab?": "The Data Structures lab is adjacent to the Programming lab on the second floor, CSE wing.",
  "Where can I find the AI and ML lab?": "The AI and Machine Learning lab is in the new engineering block, second floor, next to the IoT lab.",
  "Where is the Web Development lab?": "The Web Development lab is on the second floor of the IT department block.",
  "Where is the Java Programming lab?": "The Java Programming lab is on the second floor of the academic block, near the CSE labs.",
  "Where is the IoT lab?": "The IoT lab is located beside the Embedded Systems lab in the east wing, second floor.",
  "Where is the Computer Networks lab?": "The CN lab is on the second floor near the HOD room of the CSE department.",
  "Where is the Operating Systems lab?": "The OS lab is part of the central CSE lab cluster on the second floor.",
  "Where is the Embedded Systems lab?": "The Embedded Systems lab is located in the ECE department on the first floor.",
  "Where is the VLSI lab?": "The VLSI lab is located beside the Digital Electronics lab in the ECE wing, first floor.",
  "Where is the Digital Signal Processing lab?": "The DSP lab is part of the ECE department on the first floor, west corridor.",
  "Where is the Analog Communications lab?": "Located in the ECE department on the first floor, next to the DSP lab.",
  "Where is the Digital Electronics lab?": "This lab is on the first floor in the ECE department block.",
  "Where is the Microprocessors and Microcontrollers lab?": "This lab is in the EEE department, located on the ground floor.",
  "Where is the Power Electronics lab?": "The Power Electronics lab is in the EEE block, ground floor next to the Machines lab.",
  "Where is the Electrical Machines lab?": "It is on the ground floor of the EEE block, near the Power Systems lab.",
  "Where is the Power Systems lab?": "The Power Systems lab is adjacent to the Electrical Machines lab in the EEE wing.",
  "Where is the Physics lab located?": "The Physics lab is on the ground floor of the Science block.",
  "Where is the Chemistry lab located?": "The Chemistry lab is on the first floor of the Science block.",
  "Where is the Engineering Drawing lab?": "It is on the ground floor of the academic block, near the first-year classrooms.",
  "Where is the Civil Engineering lab?": "The Civil Engineering lab is located in the workshop block on the backside of the main building.",
  "Where is the Surveying lab?": "Surveying lab is located outside the main building, near the mechanical workshop area.",
  "Where is the Mechanical Engineering lab?": "The Mechanical lab is in the workshop building, behind the academic block.",
  "Where is the Thermal Engineering lab?": "The Thermal lab is inside the Mechanical Engineering wing near the fluid mechanics section.",
  "Where is the Fluid Mechanics lab?": "Located beside the Thermal Engineering lab in the Mechanical workshop block.",
  "Where is the MBA Business Simulation lab?": "This lab is on the third floor of the management studies block.",
  "Where is the MBA Computer Applications lab?": "The MBA Computer lab is beside the Business Communication room, third floor.",
  "Where is the Language lab located?": "The Language lab is on the first floor, near the general communication wing.",
  "Where is the Principal's office located?": "The Principal’s office is on the First floor of the main administrative block.",
  "Where can I find the library?": "The library is located on the first floor above the main entrance in the academic block.",
  "Where is the CSE department?": "The CSE department is on the second floor of the new engineering block.",
  "Where is the placement cell?": "The placement cell is on the ground floor next to the administrative office.",
  "Where can I find the seminar hall?": "The seminar hall is located on the first floor of the academic block near the IT labs.",
  "Where is the ECE lab?": "ECE labs are located on the first floor, west wing of the academic block.",
  "Where is the MBA department located?": "The MBA department is situated on the third floor of the management block.",
  "Where is the examination cell?": "The exam cell is on the ground floor beside the principal's office.",
  "Where is the cafeteria?": "The cafeteria is located behind the main building, near the open auditorium.",
  "Where is the auditorium located?": "The auditorium is located in the center of the campus next to the basketball court.",
  "Where is the girls' hostel?": "The hostel is located within campus premises, behind the academic blocks.",
  "Where is the IT department?": "The IT department is on the second floor of the academic block near the CSE department.",
  "Where are the language labs located?": "Language labs are on the first floor, adjacent to the communication lab.",
  "Where is the physics lab?": "The physics lab is on the ground floor of the science block.",
  "Where is the chemistry lab?": "The chemistry lab is on the first floor of the science block.",
  "Where can I find the HOD office of CSE?": "The HOD room for CSE is on the First floor.",
  "Where is the computer lab located?": "Computer labs are on the second floor of the academic block, next to IT classrooms.",
  "Where is the mechanical workshop?": "The mechanical workshop is behind the main building in the workshop block.",
  "Where can I meet the academic coordinator?": "The academic coordinator's cabin is located beside the HOD chambers on each floor.",
  "Where is the common room for girls?": "The girls’ common room is on the ground floor near the washroom corridor.",
  "Where is the sports room?": "The sports room is on the ground floor beside the NCC/NSS office.",
  "Where can I collect my ID card?": "ID cards are issued in the admin block near the student services desk.",
  "Where are the restrooms located?": "Restrooms are available on every floor at both ends of each building.",
  "Where is the college reception?": "The reception is at the main entrance of the administrative block.",
  "Where is the Wi-Fi helpdesk?": "The Wi-Fi helpdesk is on the first floor near the computer network lab."
}
